# GetPartialConvertFailureResults Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DesignToFabricationConverter..::..GetPartialConvertFailureResults Method
DesignToFabricationConverter Class See Also
---
Gets the partial failure results.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public IList<PartialFailureResults> GetPartialConvertFailureResults()
```

Visual Basic
---
```text
Public Function GetPartialConvertFailureResults As IList(Of PartialFailureResults)
```

Visual C++
---
```text
public:
IList<PartialFailureResults>^ GetPartialConvertFailureResults()
```

# Remarks
After the Convert method has been invoked and returned the DesignToFabricationConverterResult::Enum::PartialFailure, calls this method to get partial failure results.
# See Also
DesignToFabricationConverter Class
Autodesk.Revit.DB.Fabrication Namespace